sin1111yi/ThetaRush/src/platform/STM32/platform/periph/io/io_res.h
/**
 * This file is a part of ThetaRush.
 *
 * ThetaRush is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * ThetaRush is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.
 *
 * If not, see <https://www.gnu.org/licenses/>.
 */

#pragma once

#define GPIO_TAG_A 0x0001
#define GPIO_TAG_B 0x0002
#define GPIO_TAG_C 0x0003
#define GPIO_TAG_D 0x0004
#define GPIO_TAG_E 0x0005
#define GPIO_TAG_F 0x0006
#define GPIO_TAG_G 0x0007
#define GPIO_TAG_H 0x0008
#define GPIO_TAG_I 0x0009
#define GPIO_TAG_J 0x000A

#define IO_RES_I__PA0 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 0)))
#define IO_RES_I__PA1 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 1)))
#define IO_RES_I__PA2 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 2)))
#define IO_RES_I__PA3 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 3)))
#define IO_RES_I__PA4 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 4)))
#define IO_RES_I__PA5 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 5)))
#define IO_RES_I__PA6 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 6)))
#define IO_RES_I__PA7 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 7)))
#define IO_RES_I__PA8 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 8)))
#define IO_RES_I__PA9 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 9)))
#define IO_RES_I__PA10 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 10)))
#define IO_RES_I__PA11 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 11)))
#define IO_RES_I__PA12 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 12)))
#define IO_RES_I__PA13 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 13)))
#define IO_RES_I__PA14 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 14)))
#define IO_RES_I__PA15 ((uint32_t)((GPIO_TAG_A << 16) | (1 << 15)))
#define IO_RES_I__PB0 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 0)))
#define IO_RES_I__PB1 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 1)))
#define IO_RES_I__PB2 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 2)))
#define IO_RES_I__PB3 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 3)))
#define IO_RES_I__PB4 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 4)))
#define IO_RES_I__PB5 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 5)))
#define IO_RES_I__PB6 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 6)))
#define IO_RES_I__PB7 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 7)))
#define IO_RES_I__PB8 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 8)))
#define IO_RES_I__PB9 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 9)))
#define IO_RES_I__PB10 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 10)))
#define IO_RES_I__PB11 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 11)))
#define IO_RES_I__PB12 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 12)))
#define IO_RES_I__PB13 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 13)))
#define IO_RES_I__PB14 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 14)))
#define IO_RES_I__PB15 ((uint32_t)((GPIO_TAG_B << 16) | (1 << 15)))
#define IO_RES_I__PC0 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 0)))
#define IO_RES_I__PC1 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 1)))
#define IO_RES_I__PC2 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 2)))
#define IO_RES_I__PC3 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 3)))
#define IO_RES_I__PC4 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 4)))
#define IO_RES_I__PC5 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 5)))
#define IO_RES_I__PC6 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 6)))
#define IO_RES_I__PC7 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 7)))
#define IO_RES_I__PC8 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 8)))
#define IO_RES_I__PC9 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 9)))
#define IO_RES_I__PC10 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 10)))
#define IO_RES_I__PC11 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 11)))
#define IO_RES_I__PC12 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 12)))
#define IO_RES_I__PC13 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 13)))
#define IO_RES_I__PC14 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 14)))
#define IO_RES_I__PC15 ((uint32_t)((GPIO_TAG_C << 16) | (1 << 15)))
#define IO_RES_I__PD0 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 0)))
#define IO_RES_I__PD1 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 1)))
#define IO_RES_I__PD2 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 2)))
#define IO_RES_I__PD3 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 3)))
#define IO_RES_I__PD4 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 4)))
#define IO_RES_I__PD5 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 5)))
#define IO_RES_I__PD6 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 6)))
#define IO_RES_I__PD7 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 7)))
#define IO_RES_I__PD8 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 8)))
#define IO_RES_I__PD9 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 9)))
#define IO_RES_I__PD10 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 10)))
#define IO_RES_I__PD11 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 11)))
#define IO_RES_I__PD12 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 12)))
#define IO_RES_I__PD13 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 13)))
#define IO_RES_I__PD14 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 14)))
#define IO_RES_I__PD15 ((uint32_t)((GPIO_TAG_D << 16) | (1 << 15)))
#define IO_RES_I__PE0 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 0)))
#define IO_RES_I__PE1 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 1)))
#define IO_RES_I__PE2 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 2)))
#define IO_RES_I__PE3 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 3)))
#define IO_RES_I__PE4 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 4)))
#define IO_RES_I__PE5 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 5)))
#define IO_RES_I__PE6 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 6)))
#define IO_RES_I__PE7 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 7)))
#define IO_RES_I__PE8 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 8)))
#define IO_RES_I__PE9 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 9)))
#define IO_RES_I__PE10 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 10)))
#define IO_RES_I__PE11 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 11)))
#define IO_RES_I__PE12 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 12)))
#define IO_RES_I__PE13 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 13)))
#define IO_RES_I__PE14 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 14)))
#define IO_RES_I__PE15 ((uint32_t)((GPIO_TAG_E << 16) | (1 << 15)))
#define IO_RES_I__PF0 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 0)))
#define IO_RES_I__PF1 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 1)))
#define IO_RES_I__PF2 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 2)))
#define IO_RES_I__PF3 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 3)))
#define IO_RES_I__PF4 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 4)))
#define IO_RES_I__PF5 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 5)))
#define IO_RES_I__PF6 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 6)))
#define IO_RES_I__PF7 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 7)))
#define IO_RES_I__PF8 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 8)))
#define IO_RES_I__PF9 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 9)))
#define IO_RES_I__PF10 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 10)))
#define IO_RES_I__PF11 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 11)))
#define IO_RES_I__PF12 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 12)))
#define IO_RES_I__PF13 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 13)))
#define IO_RES_I__PF14 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 14)))
#define IO_RES_I__PF15 ((uint32_t)((GPIO_TAG_F << 16) | (1 << 15)))
#define IO_RES_I__PG0 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 0)))
#define IO_RES_I__PG1 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 1)))
#define IO_RES_I__PG2 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 2)))
#define IO_RES_I__PG3 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 3)))
#define IO_RES_I__PG4 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 4)))
#define IO_RES_I__PG5 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 5)))
#define IO_RES_I__PG6 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 6)))
#define IO_RES_I__PG7 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 7)))
#define IO_RES_I__PG8 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 8)))
#define IO_RES_I__PG9 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 9)))
#define IO_RES_I__PG10 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 10)))
#define IO_RES_I__PG11 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 11)))
#define IO_RES_I__PG12 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 12)))
#define IO_RES_I__PG13 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 13)))
#define IO_RES_I__PG14 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 14)))
#define IO_RES_I__PG15 ((uint32_t)((GPIO_TAG_G << 16) | (1 << 15)))
#define IO_RES_I__PH0 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 0)))
#define IO_RES_I__PH1 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 1)))
#define IO_RES_I__PH2 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 2)))
#define IO_RES_I__PH3 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 3)))
#define IO_RES_I__PH4 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 4)))
#define IO_RES_I__PH5 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 5)))
#define IO_RES_I__PH6 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 6)))
#define IO_RES_I__PH7 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 7)))
#define IO_RES_I__PH8 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 8)))
#define IO_RES_I__PH9 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 9)))
#define IO_RES_I__PH10 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 10)))
#define IO_RES_I__PH11 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 11)))
#define IO_RES_I__PH12 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 12)))
#define IO_RES_I__PH13 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 13)))
#define IO_RES_I__PH14 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 14)))
#define IO_RES_I__PH15 ((uint32_t)((GPIO_TAG_H << 16) | (1 << 15)))
#define IO_RES_I__PI0 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 0)))
#define IO_RES_I__PI1 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 1)))
#define IO_RES_I__PI2 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 2)))
#define IO_RES_I__PI3 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 3)))
#define IO_RES_I__PI4 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 4)))
#define IO_RES_I__PI5 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 5)))
#define IO_RES_I__PI6 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 6)))
#define IO_RES_I__PI7 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 7)))
#define IO_RES_I__PI8 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 8)))
#define IO_RES_I__PI9 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 9)))
#define IO_RES_I__PI10 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 10)))
#define IO_RES_I__PI11 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 11)))
#define IO_RES_I__PI12 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 12)))
#define IO_RES_I__PI13 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 13)))
#define IO_RES_I__PI14 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 14)))
#define IO_RES_I__PI15 ((uint32_t)((GPIO_TAG_I << 16) | (1 << 15)))
#define IO_RES_I__PJ0 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 0)))
#define IO_RES_I__PJ1 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 1)))
#define IO_RES_I__PJ2 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 2)))
#define IO_RES_I__PJ3 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 3)))
#define IO_RES_I__PJ4 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 4)))
#define IO_RES_I__PJ5 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 5)))
#define IO_RES_I__PJ6 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 6)))
#define IO_RES_I__PJ7 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 7)))
#define IO_RES_I__PJ8 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 8)))
#define IO_RES_I__PJ9 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 9)))
#define IO_RES_I__PJ10 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 10)))
#define IO_RES_I__PJ11 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 11)))
#define IO_RES_I__PJ12 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 12)))
#define IO_RES_I__PJ13 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 13)))
#define IO_RES_I__PJ14 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 14)))
#define IO_RES_I__PJ15 ((uint32_t)((GPIO_TAG_J << 16) | (1 << 15)))
